{
  "players": [
    {
      "name": "Virat Kohli",
      "sport": "Cricket",
      "shortname": "virat",
      "summary": "this is vk",
      "fullname": "virat kohli",
      "imagePath": "/images/vk.jpg",
      "country": "india",
      "description": "<p>Virat Kohli ( born 5 November 1988) is an Indian international cricketer and former captain of the India national cricket team. He plays for Delhi in domestic cricket and Royal Challengers Bangalore in the Indian Premier League as a right-handed batsman. </p><p>He is often considered one of the best batsmen of his era and some critics believe him to be one of the best limited-overs batsmen in history. Between 2013 and 2022, he captained the India cricket team in 213 matches across all three formats. With 40 wins out of 68 matches, though mostly winning at home, Kohli is one of the most successful Indian Test captains Kohli made his Test debut in 2011.</p></p><p>He reached the number one spot in the ICC rankings for ODI batsmen for the first time in 2013. He has won Man of the Tournament twice at the ICC World Twenty20 (in 2014 and 2016). He also holds the world record of being the fastest to 23,000 international runs.Kohli has been the recipient of many awards– most notably the Sir Garfield Sobers Trophy (ICC Men's Cricketer of the Decade): 2011–2020; Sir Garfield Sobers Trophy (ICC Cricketer of the Year) in 2017 and 2018; ICC Test Player of the Year (2018); ICC ODI Player of the Year (2012, 2017, 2018) and Wisden Leading Cricketer in the World (2016, 2017 and 2018).</p> At the national level, he was awarded the Arjuna Award in 2013, the Padma Shri under the sports category in 2017 and the Rajiv Gandhi Khel Ratna award, the highest sporting honour in India, in 2018.In 2016, he was ranked as one of the world's most famous athletes by ESPN and one of the most valuable athlete brands by Forbes.</p><p> In 2018, Time magazine named him one of the 100 most influential people in the world. In 2020, he was ranked 66th in Forbes list of the top 100 highest-paid athletes in the world for the year 2020 with estimated earnings of over $26 million.</p>"
    },
    {
      "name": "Suresh Raina",
      "sport": "Cricket",
      "shortname": "suresh",
      "summary": "this is vk",
      "fullname": "Suresh Raina",
      "imagePath": "/images/raina.jpg",
      "country": "india",
      "description": "<p>Suresh Kumar Raina was born in Muradnagar of Uttar Pradesh on 27 November 1986 into a Kashmiri Pandit family, to parents from Rainawari, Srinagar district of Jammu and Kashmir.Raina lives in the Rajnagar neighborhood of Ghaziabad city. He has an older brother, Dinesh Raina. He studied in a boarding school[year needed].</p><p>In 2000, Raina decided to play cricket and subsequently moved from his hometown Muradnagar, Ghaziabad district to Lucknow, to attend the Guru Gobind Singh Sports College, Lucknow. He rose to become the captain of the Uttar Pradesh U-16s and came to prominence amongst Indian selectors in 2002 when he was selected at the age of 15 and a half years for the U-19 tour to England, where he made a pair of half-centuries in the U-19 Test matches. He toured Sri Lanka later that year with the U-17 team.</p><p>He made his Ranji Trophy debut for Uttar Pradesh against Assam in February 2003 at the age of 16 but did not play another match until the following season. He debuted in List A Cricket against Madhya Pradesh at Indore in 2005 and scored 16 runs. He played for India green, UP under 16, India Blue, India Red, Rest of India, India under 19, Indian board's president's XI, Rajasthan Cricket association's president's XI, India seniors, Central zone. In Ranji trophy 2005-06 season he scored 620 in 6 games. In 2018 Akshdeep Nath replaced him as UP's Ranji trophy captain due to poor performance of scoring 105 runs in 9 innings averaging 11.66.</p><p>In late 2003, he toured Pakistan for the U-19 Asian ODI Championship before being selected for the 2004 U-19 World Cup, where he scored three half-centuries, including a 90 scored off only 38 balls. He was then awarded a Border-Gavaskar scholarship to train at the Australian Cricket Academy and in early 2005, he made his first-class limited overs debut, and scored 645 runs that season at an average of 53.75</p>"
    },
    {
      "name": "Cristiano Ronaldo",
      "sport": "Football",
      "shortname": "ronaldo",
      "summary": "this is vk",
      "fullname": "Cristiano Ronaldo",
      "imagePath": "/images/ronaldo.jpg",
      "country": "india",
      "description": "<p>Cristiano Ronaldo dos Santos Aveiro GOIH ComM (Portuguese pronunciation: [kɾiʃˈtjɐnu ʁɔˈnaɫdu]; born 5 February 1985) is a Portuguese professional footballer who plays as a forward for Premier League club Manchester United and captains the Portugal national team. Often considered the best player in the world and widely regarded as one of the greatest players of all time, Ronaldo has won five Ballon d'Or awards[note 3] and four European Golden Shoes, the most by a European player. He has won 32 trophies in his career, including seven league titles, five UEFA Champions Leagues, one UEFA European Championship, and one UEFA Nations League. Ronaldo holds the records for most appearances (183), most goals (140), and assists (42) in the Champions League, most goals in the European Championship (14), most international goals by a male player (117), and most international appearances by a European male (188). He is one of the few players to have made over 1,100 professional career appearances, and has scored over 800 official senior career goals for club and country.</p><p> Ronaldo began his senior career with Sporting CP, before signing with Manchester United in 2003, aged 18, winning the FA Cup in his first season. He would also go onto win three consecutive Premier League titles, the Champions League and the FIFA Club World Cup; at age 23, he won his first Ballon d'Or. Ronaldo was the subject of the then-most expensive association football transfer when he signed for Real Madrid in 2009 in a transfer worth €94 million (£80 million), where he won 15 trophies, including two La Liga titles, two Copa del Rey, and four Champions Leagues, and became the club's all-time top goalscorer. He won back-to-back Ballons d'Or in 2013 and 2014, and again in 2016 and 2017, and was runner-up three times behind Lionel Messi, his perceived career rival. In 2018, he signed for Juventus in a transfer worth an initial €100 million (£88 million), the most expensive transfer for an Italian club and the most expensive for a player over 30 years old. He won two Serie A titles, two Supercoppe Italiana, and a Coppa Italia, before returning to United in 2021.</p><p>Ronaldo made his international debut for Portugal in 2003 at the age of 18 and has since earned over 180 caps, making him Portugal's most-capped player. With more than 100 goals at international level, he is also the nation's all-time top goalscorer. Ronaldo has played in and scored at 11 major tournaments; he scored his first international goal at Euro 2004, where he helped Portugal reach the final. He assumed captaincy of the national team in July 2008. In 2015, Ronaldo was named the best Portuguese player of all time by the Portuguese Football Federation. The following year, he led Portugal to their first major tournament title at Euro 2016, and received the Silver Boot as the second-highest goalscorer of the tournament. He also led them to victory in the inaugural UEFA Nations League in 2019, and later received the Golden Boot as top scorer of Euro 2020.</p><p>One of the world's most marketable and famous athletes, Ronaldo was ranked the world's highest-paid athlete by Forbes in 2016 and 2017 and the world's most famous athlete by ESPN from 2016 to 2019. Time included him on their list of the 100 most influential people in the world in 2014. He is the first footballer and the third sportsman to earn US$1 billion in his career.</p>"
    }
  ],
  "topplayers": [
    {
      "name": "Virat Kohli",
      "sportName": "Cricket",
      "imagePath": "/images/vk_tn.jpg",
      "shortname": "virat"
    },
    {
      "name": "Suresh Raina",
      "sportName": "Cricket",
      "imagePath": "/images/raina.jpg",
      "shortname": "suresh"
    },
    {
      "name": "Cristiano Ronaldo",
      "sportName": "Football",
      "imagePath": "/images/ronaldo.jpg",
      "shortname": "ronaldo"
    }
  ]
}
